tiborsimon/embedded-tdd-headers/pic/8bit/pic12lf1840_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC12LF1840_H_
#define _PIC12LF1840_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define PIR1                          42
#define TMR1IF                        43
#define TMR2IF                        44
#define CCP1IF                        45
#define SSP1IF                        46
#define TXIF                          47
#define RCIF                          48
#define ADIF                          49
#define TMR1GIF                       50
#define PIR2                          51
#define BCL1IF                        52
#define EEIF                          53
#define C1IF                          54
#define OSFIF                         55
#define TMR0                          56
#define TMR1L                         57
#define TMR1H                         58
#define T1CON                         59
#define TMR1ON                        60
#define nT1SYNC                       61
#define T1OSCEN                       62
#define T1CKPS0                       63
#define T1CKPS                        64
#define T1CKPS1                       65
#define TMR1CS                        66
#define TMR1CS0                       67
#define TMR1CS1                       68
#define T1GCON                        69
#define T1GSS0                        70
#define T1GSS                         71
#define T1GSS1                        72
#define T1GVAL                        73
#define T1GGO_nDONE                   74
#define T1GGO                         75
#define T1GSPM                        76
#define T1GTM                         77
#define T1GPOL                        78
#define TMR1GE                        79
#define TMR2                          80
#define PR2                           81
#define T2CON                         82
#define T2CKPS0                       83
#define T2CKPS                        84
#define T2CKPS1                       85
#define TMR2ON                        86
#define T2OUTPS0                      87
#define T2OUTPS                       88
#define T2OUTPS1                      89
#define T2OUTPS2                      90
#define T2OUTPS3                      91
#define CPSCON0                       92
#define T0XCS                         93
#define CPSOUT                        94
#define CPSRNG                        95
#define CPSRNG0                       96
#define CPSRNG1                       97
#define CPSRM                         98
#define CPSON                         99
#define CPSCON1                       100
#define CPSCH                         101
#define CPSCH0                        102
#define CPSCH1                        103
#define TRISA                         104
#define TRISA0                        105
#define TRISA1                        106
#define TRISA2                        107
#define TRISA3                        108
#define TRISA4                        109
#define TRISA5                        110
#define PIE1                          111
#define TMR1IE                        112
#define TMR2IE                        113
#define CCP1IE                        114
#define SSP1IE                        115
#define TXIE                          116
#define RCIE                          117
#define ADIE                          118
#define TMR1GIE                       119
#define PIE2                          120
#define BCL1IE                        121
#define EEIE                          122
#define C1IE                          123
#define OSFIE                         124
#define OPTION_REG                    125
#define PS                            126
#define PS0                           127
#define PS1                           128
#define PS2                           129
#define PSA                           130
#define T0SE                          131
#define TMR0SE                        132
#define T0CS                          133
#define TMR0CS                        134
#define INTEDG                        135
#define nWPUEN                        136
#define PCON                          137
#define nBOR                          138
#define nPOR                          139
#define nRI                           140
#define nRMCLR                        141
#define STKUNF                        142
#define STKOVF                        143
#define WDTCON                        144
#define SWDTEN                        145
#define WDTPS                         146
#define WDTPS0                        147
#define WDTPS1                        148
#define WDTPS2                        149
#define WDTPS3                        150
#define WDTPS4                        151
#define OSCTUNE                       152
#define TUN0                          153
#define TUN                           154
#define TUN1                          155
#define TUN2                          156
#define TUN3                          157
#define TUN4                          158
#define TUN5                          159
#define OSCCON                        160
#define SCS0                          161
#define SCS                           162
#define SCS1                          163
#define IRCF                          164
#define IRCF0                         165
#define IRCF1                         166
#define IRCF2                         167
#define IRCF3                         168
#define SPLLEN                        169
#define OSCSTAT                       170
#define HFIOFS                        171
#define LFIOFR                        172
#define MFIOFR                        173
#define HFIOFL                        174
#define HFIOFR                        175
#define OSTS                          176
#define PLLR                          177
#define T1OSCR                        178
#define ADRESL                        179
#define ADRESH                        180
#define ADCON0                        181
#define ADON                          182
#define GO_nDONE                      183
#define GO                            184
#define ADGO                          185
#define CHS0                          186
#define CHS                           187
#define CHS1                          188
#define CHS2                          189
#define CHS3                          190
#define CHS4                          191
#define ADCON1                        192
#define ADPREF0                       193
#define ADPREF                        194
#define ADPREF1                       195
#define ADCS0                         196
#define ADCS                          197
#define ADCS1                         198
#define ADCS2                         199
#define ADFM                          200
#define LATA                          201
#define LATA0                         202
#define LATA1                         203
#define LATA2                         204
#define LATA4                         205
#define LATA5                         206
#define CM1CON0                       207
#define C1SYNC                        208
#define C1HYS                         209
#define C1SP                          210
#define C1POL                         211
#define C1OE                          212
#define C1OUT                         213
#define C1ON                          214
#define CM1CON1                       215
#define C1NCH0                        216
#define C1NCH                         217
#define C1PCH                         218
#define C1PCH0                        219
#define C1PCH1                        220
#define C1INTN                        221
#define C1INTP                        222
#define CMOUT                         223
#define MC1OUT                        224
#define BORCON                        225
#define BORRDY                        226
#define BORFS                         227
#define SBOREN                        228
#define FVRCON                        229
#define ADFVR0                        230
#define ADFVR                         231
#define ADFVR1                        232
#define CDAFVR0                       233
#define CDAFVR                        234
#define CDAFVR1                       235
#define TSRNG                         236
#define TSEN                          237
#define FVRRDY                        238
#define FVREN                         239
#define DACCON0                       240
#define DACPSS                        241
#define DACPSS0                       242
#define DACPSS1                       243
#define DACOE                         244
#define DACLPS                        245
#define DACEN                         246
#define DACCON1                       247
#define DACR0                         248
#define DACR                          249
#define DACR1                         250
#define DACR2                         251
#define DACR3                         252
#define DACR4                         253
#define SRCON0                        254
#define SRPR                          255
#define SRPS                          256
#define SRNQEN                        257
#define SRQEN                         258
#define SRCLK0                        259
#define SRCLK                         260
#define SRCLK1                        261
#define SRCLK2                        262
#define SRLEN                         263
#define SRCON1                        264
#define SRRC1E                        265
#define SRRCKE                        266
#define SRRPE                         267
#define SRSC1E                        268
#define SRSCKE                        269
#define SRSPE                         270
#define APFCON                        271
#define CCP1SEL                       272
#define P1BSEL                        273
#define TXCKSEL                       274
#define T1GSEL                        275
#define SSSEL                         276
#define SS1SEL                        277
#define SDO1SEL                       278
#define SDOSEL                        279
#define RXDTSEL                       280
#define ANSA0                         281
#define ANSELA                        282
#define ANSA1                         283
#define ANSA2                         284
#define ANSA4                         285
#define EEADRL                        286
#define EEADRH                        287
#define EEDATL                        288
#define EEDATH                        289
#define EECON1                        290
#define RD                            291
#define WR                            292
#define WREN                          293
#define WRERR                         294
#define FREE                          295
#define LWLO                          296
#define CFGS                          297
#define EEPGD                         298
#define EECON2                        299
#define RCREG                         300
#define TXREG                         301
#define SP1BRGL                       302
#define SPBRGL                        303
#define SP1BRGH                       304
#define SPBRGH                        305
#define RCSTA                         306
#define RX9D                          307
#define OERR                          308
#define FERR                          309
#define ADDEN                         310
#define CREN                          311
#define SREN                          312
#define RX9                           313
#define SPEN                          314
#define TXSTA                         315
#define TX9D                          316
#define TRMT                          317
#define BRGH                          318
#define SENDB                         319
#define SYNC                          320
#define TXEN                          321
#define TX9                           322
#define CSRC                          323
#define BAUDCON                       324
#define ABDEN                         325
#define WUE                           326
#define BRG16                         327
#define SCKP                          328
#define RCIDL                         329
#define ABDOVF                        330
#define WPUA0                         331
#define WPUA                          332
#define WPUA1                         333
#define WPUA2                         334
#define WPUA3                         335
#define WPUA4                         336
#define WPUA5                         337
#define SSP1BUF                       338
#define SSPBUF                        339
#define SSP1ADD                       340
#define SSPADD                        341
#define SSP1MSK                       342
#define SSPMSK                        343
#define SSP1STAT                      344
#define BF                            345
#define UA                            346
#define R_nW                          347
#define S                             348
#define P                             349
#define D_nA                          350
#define CKE                           351
#define SMP                           352
#define SSP1CON1                      353
#define SSPM0                         354
#define SSPM                          355
#define SSPM1                         356
#define SSPM2                         357
#define SSPM3                         358
#define CKP                           359
#define SSPEN                         360
#define SSPOV                         361
#define WCOL                          362
#define SSP1CON2                      363
#define SEN                           364
#define RSEN                          365
#define PEN                           366
#define RCEN                          367
#define ACKEN                         368
#define ACKDT                         369
#define ACKSTAT                       370
#define GCEN                          371
#define SSP1CON3                      372
#define DHEN                          373
#define AHEN                          374
#define SBCDE                         375
#define SDAHT                         376
#define BOEN                          377
#define SCIE                          378
#define PCIE                          379
#define ACKTIM                        380
#define CCPR1L                        381
#define CCPR1H                        382
#define CCP1CON                       383
#define CCP1M0                        384
#define CCP1M                         385
#define CCP1M1                        386
#define CCP1M2                        387
#define CCP1M3                        388
#define DC1B                          389
#define DC1B0                         390
#define DC1B1                         391
#define P1M                           392
#define P1M0                          393
#define P1M1                          394
#define PWM1CON                       395
#define P1DC                          396
#define P1DC0                         397
#define P1DC1                         398
#define P1DC2                         399
#define P1DC3                         400
#define P1DC4                         401
#define P1DC5                         402
#define P1DC6                         403
#define P1RSEN                        404
#define PSS1BD                        405
#define PSS1BD0                       406
#define PSS1BD1                       407
#define PSS1AC                        408
#define PSS1AC0                       409
#define PSS1AC1                       410
#define CCP1AS                        411
#define CCP1AS0                       412
#define CCP1AS1                       413
#define CCP1AS2                       414
#define CCP1ASE                       415
#define PSTR1CON                      416
#define STR1A                         417
#define STR1B                         418
#define STR1SYNC                      419
#define IOCAP                         420
#define IOCAP0                        421
#define IOCAP1                        422
#define IOCAP2                        423
#define IOCAP3                        424
#define IOCAP4                        425
#define IOCAP5                        426
#define IOCAN0                        427
#define IOCAN                         428
#define IOCAN1                        429
#define IOCAN2                        430
#define IOCAN3                        431
#define IOCAN4                        432
#define IOCAN5                        433
#define IOCAF0                        434
#define IOCAF                         435
#define IOCAF1                        436
#define IOCAF2                        437
#define IOCAF3                        438
#define IOCAF4                        439
#define IOCAF5                        440
#define CLKRCON                       441
#define CLKRDIV                       442
#define CLKRDIV0                      443
#define CLKRDIV1                      444
#define CLKRDIV2                      445
#define CLKRDC                        446
#define CLKRDC0                       447
#define CLKRDC1                       448
#define CLKRSLR                       449
#define CLKROE                        450
#define CLKREN                        451
#define MDCON                         452
#define MDBIT                         453
#define MDOUT                         454
#define MDOPOL                        455
#define MDSLR                         456
#define MDOE                          457
#define MDEN                          458
#define MDSRC                         459
#define MDMS0                         460
#define MDMS                          461
#define MDMS1                         462
#define MDMS2                         463
#define MDMS3                         464
#define MDMSODIS                      465
#define MDCARL                        466
#define MDCL0                         467
#define MDCL                          468
#define MDCL1                         469
#define MDCL2                         470
#define MDCL3                         471
#define MDCLSYNC                      472
#define MDCLPOL                       473
#define MDCLODIS                      474
#define MDCARH                        475
#define MDCH                          476
#define MDCH0                         477
#define MDCH1                         478
#define MDCH2                         479
#define MDCH3                         480
#define MDCHSYNC                      481
#define MDCHPOL                       482
#define MDCHODIS                      483
#define STATUS_SHAD                   484
#define C_SHAD                        485
#define DC_SHAD                       486
#define Z_SHAD                        487
#define WREG_SHAD                     488
#define BSR_SHAD                      489
#define PCLATH_SHAD                   490
#define FSR0L_SHAD                    491
#define FSR0H_SHAD                    492
#define FSR1L_SHAD                    493
#define FSR1H_SHAD                    494
#define STKPTR                        495
#define TOSL                          496
#define TOSH                          497

#endif // _PIC12LF1840_H_
